test run jmeter/report/statistics.json
{
  "login (get)" : {
    "transaction" : "login (get)",
    "sampleCount" : 8390,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 265.48116805721054,
    "medianResTime" : 228.0,
    "minResTime" : 13.0,
    "maxResTime" : 2739.0,
    "pct1ResTime" : 471.0,
    "pct2ResTime" : 574.0,
    "pct3ResTime" : 923.1800000000003,
    "throughput" : 9.374867310429902,
    "receivedKBytesPerSec" : 49.20812239474505,
    "sentKBytesPerSec" : 3.3653686839066266
  },
  "register (post)" : {
    "transaction" : "register (post)",
    "sampleCount" : 8424,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 808.0604226020856,
    "medianResTime" : 781.0,
    "minResTime" : 101.0,
    "maxResTime" : 3224.0,
    "pct1ResTime" : 1200.0,
    "pct2ResTime" : 1345.0,
    "pct3ResTime" : 1696.75,
    "throughput" : 9.403916289069958,
    "receivedKBytesPerSec" : 6.681985035044212,
    "sentKBytesPerSec" : 5.649499482025504
  },
  "register (get)" : {
    "transaction" : "register (get)",
    "sampleCount" : 8446,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 260.4956192280372,
    "medianResTime" : 225.0,
    "minResTime" : 13.0,
    "maxResTime" : 2460.0,
    "pct1ResTime" : 468.0,
    "pct2ResTime" : 576.6499999999996,
    "pct3ResTime" : 891.590000000002,
    "throughput" : 9.425098033964277,
    "receivedKBytesPerSec" : 57.736571801927866,
    "sentKBytesPerSec" : 2.7068644105742767
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 50587,
    "errorCount" : 7096,
    "errorPct" : 14.027319,
    "meanResTime" : 380.0250854962746,
    "medianResTime" : 281.0,
    "minResTime" : 0.0,
    "maxResTime" : 3850.0,
    "pct1ResTime" : 862.0,
    "pct2ResTime" : 1056.0,
    "pct3ResTime" : 1604.9900000000016,
    "throughput" : 56.253968536387106,
    "receivedKBytesPerSec" : 782.305472780219,
    "sentKBytesPerSec" : 19.018900050291297
  },
  "Default Route Request" : {
    "transaction" : "Default Route Request",
    "sampleCount" : 8493,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 289.5935476274564,
    "medianResTime" : 253.0,
    "minResTime" : 13.0,
    "maxResTime" : 2866.0,
    "pct1ResTime" : 523.0,
    "pct2ResTime" : 634.0,
    "pct3ResTime" : 926.0,
    "throughput" : 9.448067334583731,
    "receivedKBytesPerSec" : 627.2040115037423,
    "sentKBytesPerSec" : 2.6150120016347502
  },
  "user registry" : {
    "transaction" : "user registry",
    "sampleCount" : 8470,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.337072018890186,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2006.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 103.0,
    "pct3ResTime" : 224.0,
    "throughput" : 9.434950084992526,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "login (post)" : {
    "transaction" : "login (post)",
    "sampleCount" : 8364,
    "errorCount" : 7096,
    "errorPct" : 84.83979,
    "meanResTime" : 644.6439502630342,
    "medianResTime" : 536.5,
    "minResTime" : 16.0,
    "maxResTime" : 3850.0,
    "pct1ResTime" : 1285.0,
    "pct2ResTime" : 1708.0,
    "pct3ResTime" : 2400.7000000000007,
    "throughput" : 9.351332374795678,
    "receivedKBytesPerSec" : 42.40885051263783,
    "sentKBytesPerSec" : 4.756150176008309
  }
}